Repository: basgate/bassdk-woocommerce-payments
Catalog: languages/bassdk-woocommerce-payments-*.po
Languages: ar

source: Basgate Payment requires WooCommerce to be installed and active. You can download %s here.
ar: يتطلب الدفع الخاص بمنصة "بس" تحميل وتفعيل أداة ال وو كوميرس, للتحميل أضغط هنا %s.

source: Basgate Payment requires Basgate Login SDK to be installed and active. You can download %s here.
ar: يتطلب الدفع الخاص بمنصة "بس" تحميل وتفعيل ال SDK الخاص بالدخول, للتحميل أضغط هنا %s.

source: BasSDK Payments
ar: منصة بس للمدفوعات

source: Basgate Payment requires WooCommerce to be installed and active. You can download <a href="https://woocommerce.com/" target="_blank">WooCommerce</a> here.
ar: يتطلب الدفع الخاص بمنصة "بس" تحميل وتفعيل أداة ال وو كوميرس, للتحميل أضغط هنا <a href="https://woocommerce.com/" target="_blank">WooCommerce</a> .

source: Basgate Payment requires Basgate Login SDK to be installed and active. You can download <a href="https://basgate.github.io/" target="_blank">Basgate Login SDK</a> here.
ar: يتطلب الدفع الخاص بمنصة "بس" تحميل وتفعيل ال SDK الخاص بالدخول, للتحميل أضغط هنا<a href="https://basgate.github.io/" target="_blank">Basgate Login SDK</a> .

source: Fetch Status
ar: التحقق من حالة الطلب

source: Something went wrong. Please again
ar: حدث خطاء ما, يرجى إعادة المحاولة

source: Updated <b>STATUS</b> has been fetched
ar: تم تحديث ال <b>الحالة</b> بنجاح

source: Pay via Basgate
ar: الدفع بواسطة منصة بس

source: Description
ar: الوصف

source: This controls the description which the user sees during checkout.
ar: تقوم هذه الخاصية بالتحكم ب الوصف الذي يشاهدة المستخدم اُثناء الدفع.

source: Environment Mode
ar: تحديد البيئة

source: Select "Test/Staging" to setup test transactions & "Production" once you are ready to go live
ar: اختر "Test/Staging" للبدء بأعداد العمليات التجريبية و "الفعلية" عندما تكون جاهز للنشر

source: Application Id
ar: معرف التطبيق

source: Based on the selected Environment Mode, copy the relevant Application ID for test or production environment you received on email.
ar: إعتمادً على نمط البيئة الذي تم إختيارة, أنسخ معرف التطبيق التجريبي او الفعلي التابع لها لكي يتم البدء والذي تم إرسالة الى الايميل الخاص بك.

source: Merchant Key
ar: مفتاح التاجر

source: Based on the selected Environment Mode, copy the Merchant Key for test or production environment you received on email.
ar: إعتمادً على نمط البيئة الذي تم إختيارة, أنسخ مفتاح التاجر التجريبي او الفعلي التابع لها لكي يتم البدء والذي تم إرسالة الى الايميل الخاص بك.

source: Client Id
ar: معرف العميل

source: Based on the selected Environment Mode, copy the Client Id for test or production environment you received on email.
ar: إعتمادً على نمط البيئة الذي تم إختيارة, أنسخ معرف العميل التجريبي او الفعلي التابع لها لكي يتم البدء والذي تم إرسالة الى الايميل الخاص بك.

source: Client Secret
ar: شفرة العميل السرية

source: Based on the selected Environment Mode, copy the Client Secret for test or production environment you received on email.
ar: إعتمادً على نمط البيئة الذي تم إختيارة, أنسخ شفرة العميل السرية التجريبي او الفعلي التابع لها لكي يتم البدء والذي تم إرسالة الى الايميل الخاص بك.

source: Enable/Disable
ar: تفعيل/تعطيل

source: Enable Basgate Login/Payments.
ar: تفعيل تسجيل الدخول/المدفوعات لمنصة بس.

source: Basgate Payment Gateway
ar: بوابة مدفوعات منصة بس

source: Online payment solutions for all your transactions by Basgate
ar: حلول رقمية لجميع عملياتك المالية عن طريق منصة بس

source: Please note disabled settings can be modified from
ar: يرجى الانتباه أن تعطيل الأعدادات يمكن تعديلة

source: PHP Version
ar: نسخة PHP

source: cURL Version
ar: نسخة cURL

source: Wordpress Version
ar: نسخة الوورد بريس

source: WooCommerce Version
ar: نسخة ال "Woo commerce"

source: Last Updated
ar: أخر تحديث

source: Could not retrieve signature, please try again Data: %1$s.
ar: لم يستطع إيجاد التوقيع, الرجاء المحاولة مرة أخرى %1$s.

source: Could not retrieve signature, please try again.
ar: لم يستطع إيجاد التوقيع, الرجاء المحاولة مرة أخرى.

source: Could not retrieve the Transaction Token, please try again.
ar: لم يستطع إيجاد مفتاح العملية الرجاء المحاولة مرة أخرى.

source: The best payment gateway provider in Yemen for e-payment through most of wallets and banks <img src="https://ykbsocial.com/basgate/reportlogo.png" height="24px;" />
ar: افضل مزود خدمة لبوابات الدفع المالية في اليمن والتي تضم اكثر المحافظ الالكترونية والبنوك المحلية <img src="https://ykbsocial.com/basgate/reportlogo.png" height="24px;" />

source: It seems some issue in server to server communication. Kindly connect with us.
ar: يبدو ان هناك مشكلة في الاتصال مع السيرفر, يرجى التواصل بنا.

source: Thank you for your order. Your payment has been successfully received.
ar: شكرا لك, طلب الدفع الخاص بك تم استلامة بنجاح.

source: <b>Transaction ID:</b>
ar: <b>رقم العملية:</b>

source: <b>Basgate Order ID:</b>
ar: <b>:رقم الطلب منصة بس</b>

source: Your payment has been pending!
ar: طلب الدفع الخاص بك تم تعليقة!

source: Reason:
ar: السبب:

source: Your payment has been failed!
ar: فشل طلب الدفع الخاص بك!

source: No order found to process. Kindly contact with us.
ar: لم يتم العثور على طلبك, الرجاء التواصل بنا.

source: Security Error. Checksum Mismatched!
ar: خطء امني. النتيجة غير مطابقة!

source: The best payment gateway provider in Yemen for e-payment through most of wallets and banks <img src="%s" height="24px;" />
ar: افضل مزود خدمة لبوابات الدفع المالية في اليمن والتي تضم اكثر المحافظ الالكترونية والبنوك المحلية <img src="%s" height="24px;" />

source: Could not retrieve the Transaction Token, please check that you are inside basgate platform and try again.
ar: لم نستطع جلب مفتاح العملية, الرجاء المحاولة مرة أخرى و التأكد من انه تم تنفيذ العملية من خلال منصة بس.

source: The best payment gateway provider in Yemen for e-payment through most of wallets and banks <img src="%1$s" height="24px;" />
ar: افضل مزود خدمة لبوابات الدفع المالية في اليمن والتي تضم اكثر المحافظ الالكترونية والبنوك المحلية <img src="%1$s" height="24px;" />

source: Transaction ID:
ar: رقم العملية:

source: Basgate Order ID:
ar: رقم الطلب منصة بس:

source: Could not retrieve the access token, please try again!!!.
ar: لم نستطع جلب مفتاح الدخول الرجاء المحاولة مرة أخرى!!!.

source: Could not retrieve the access token, please try again.
ar: لم نستطع جلب مفتاح الدخول الرجاء المحاولة مرة أخرى.

source: Basgate Payment requires WooCommerce to be installed and active. You can download.
ar: يتطلب الدفع الخاص بمنصة "بس" تحميل وتفعيل أداة ال وو كوميرس, للتحميل أضغط هنا .

source: Basgate Payment requires Basgate Login SDK to be installed and active. You can download
ar: يتطلب الدفع الخاص بمنصة "بس" تحميل وتفعيل ال SDK الخاص بالدخول, للتحميل أضغط هنا

source: You must log in to view your cart.
ar: يجب عليك تسجيل الدخول قبل مواصلة الشراء ...

source: Enable Debug
ar: تفعيل نمط المطور

source: Enable debug mode to log all oprations.
ar: تفعيل نمط المطور لتسحيل جميع العمليات.

source: ERROR Can not complete the request
ar: خطاء , لا يمكن أتمام الطلب

source: ERROR amount is empty
ar: خطاء, خانة المبلغ فارغة

source: Invalid order ID.
ar: خطاء في رقم الطلب.

source: Refund failed response error. Please try again.
ar: خطاء في الرد من السرفر عند عملية الاسترداد يرجى المحاولة لاحقا.

source: Refunded via Basgate :
ar: استرداد المبلغ عبر منصة بس :

source: Refunded %1$s - Reason: %2$s , BasStatus:%3$s
ar: استرداد %1$s - بسبب: %2$s , الحالة:%3$s

source: Refund failed. Please try again.
ar: خطاء في عملية الاسترداد يرجى المحاولة لاحقا.

source: ERROR Can not complete the request invalid grant
ar: خطاء , لا يمكن أتمام الطلب بسبب خطاء في التخويل

source: The best payment gateway provider in Yemen for e-payment through most of wallets and banks
ar: افضل مزود خدمة لبوابات الدفع المالية في اليمن والتي تضم اكثر المحافظ الالكترونية والبنوك المحلية

source: Bassdk Payment for WooCommerce
ar: الدفع عبر منصة بس لل WooCommerce

source: This blugin enabels you to opreat payments through Basgateway that provides you with many Local E-Wallets
ar: هذه الاضافة تمكنك من تشغيل الدفع بداخل منصة بس والذي تقدم لك العديد من المحافظ المالية

source: Basgate Super APP
ar: منصة بس للمدفوعات
